In [17]:
import pandas as pd
import numpy as np

In [18]:
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]
 
# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
 
 
# Apply function numpy.square() to square
# the values of one row only i.e. row
# with index name 'd' 
 
# printing dataframe
df

   Field_1  Field_2  Field_3
a       15      2.5      100
b       20      4.5       50
c       25      5.2       80
d       45      5.8       48
e       40      6.3       70
f       41      6.4       90
g       51      2.3      111

In [19]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [20]:
indexes = df.index.to_list()

In [21]:
df['mean_rating'] = df.apply(lambda x: np.mean(x) if x.name in indexes else x, axis=1)

In [22]:
df

   Field_1  Field_2  Field_3  mean_rating
a       15      2.5      100    39.166667
b       20      4.5       50    24.833333
c       25      5.2       80    36.733333
d       45      5.8       48    32.933333
e       40      6.3       70    38.766667
f       41      6.4       90    45.800000
g       51      2.3      111    54.766667

In [23]:
df1 = pd.DataFrame({'Fruit': ["guava","apple","orange", "mango"], 'A': [4,1,3,2],'B': [5,3,1,1]})
df2 = pd.DataFrame({'Fruit': ["guava","apple","honeydew","orange", "mango"],'E': [4,2,5,1,2],'C': [3,5,2,1,1],
'D': [4,3,5,3,3]})

In [24]:
df1

    Fruit  A  B
0   guava  4  5
1   apple  1  3
2  orange  3  1
3   mango  2  1

In [25]:
df2

      Fruit  E  C  D
0     guava  4  3  4
1     apple  2  5  3
2  honeydew  5  2  5
3    orange  1  1  3
4     mango  2  1  3

In [26]:
df3 = pd.merge(df1, df2, on='Fruit', how='inner')

In [27]:
df3

    Fruit  A  B  E  C  D
0   guava  4  5  4  3  4
1   apple  1  3  2  5  3
2  orange  3  1  1  1  3
3   mango  2  1  2  1  3

In [28]:
df3.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [29]:
indexes1 = df3.index.to_list()

In [30]:
df3['mean_rating'] = df3.apply(lambda x: np.mean(x[1:]) if x.name in indexes1 else x, axis=1)

In [31]:
df3

    Fruit  A  B  E  C  D  mean_rating
0   guava  4  5  4  3  4          4.0
1   apple  1  3  2  5  3          2.8
2  orange  3  1  1  1  3          1.8
3   mango  2  1  2  1  3          1.8

In [ ]:
#columns_list = df.columns.unique().to_list()
#df['F']= np.mean([df[column] for column in columns_list[1:]])